1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаОтгрузку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ПараметрыОтрузки</xr:Item>
				<xr:Item>AccumulationRegister.Лико_ЗаявкиНаОтгрузку</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>оставил как служебный реквизит для префиксации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыОтгрузкиГотовойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПродавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаНаОснованииЗаданияНаСписаниеГП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Comment>Для склада лк Металлострой ГП - Ликофлекс, для склада ИКС ГП - ИксПак</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ШаблоныЗаявокНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаИзЗаказаСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦены</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставкиЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Лико_СчетНаОплатуКлиенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомплекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузкаВРублях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Втулка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерГруппировки</Name>
							<Comment>имеет смысл, когда комплект состоит из позиций с разным количеством (несколько позиций формируют собой "подкомплекты")</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеальныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтгрузитьВсе</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДляДоступаСлужебная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ЗаявкиНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ЗаявкиНаОтгрузку</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНеОтгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Намотка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодЭтикеткиЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧестныйЗнак</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаОтгрузку/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	//Проверим заполнена ли валюта
	СписокВалют = Товары.Выгрузить(,"НомерСтроки,Цена,ВалютаЦены");
	ЕстьНезаполненнаяВалюта = Ложь;
	Для Каждого СтрокаСписка из СписокВалют Цикл 
		Если Не ЗначениеЗаполнено(СтрокаСписка.ВалютаЦены) и ЗначениеЗаполнено(СтрокаСписка.Цена) Тогда
			Сообщить("В строке номер " + СтрокаСписка.НомерСтроки + " не указана валюта.");
			ЕстьНезаполненнаяВалюта = Истина;
		КонецЕсли;
	КонецЦикла;
	ТЗТовары = Товары.Выгрузить(,"СчетНаОплату");
	ТЗТовары.Свернуть("СчетНаОплату");
	НесколькоСчетовНаПредоплату = Ложь;
	Если ТЗТовары.Количество() > 1 Тогда
		Сообщить("В заявке на отгрузку ""Счет на предоплату"" должен быть либо указан один и тот же во всех строках, либо не указан ни в одной строке");
		НесколькоСчетовНаПредоплату = Истина;
	КонецЕсли;
	
	//ТЗУслуги = Товары.Выгрузить(,"ВалютаЦены");
	//ТЗУслуги.Свернуть("ВалютаЦены");
	//НесколькоВалютВУслугах = Ложь;
	//Если ТЗУслуги.Количество() > 1 Тогда
	//	Сообщить("Во всех строках табличной части ""Услуги"" должно быть указано одинаковое значение колонки ""Валюта""");
	//	НесколькоВалютВУслугах = Истина;
	//КонецЕсли;
	//	
	//ТЗУслуги = Товары.Выгрузить(,"ОтгрузкаВРублях");
	//ТЗУслуги.Свернуть("ОтгрузкаВРублях");
	//НесколькоЗначенийОтгрузкиВРублях = Ложь;
	//Если ТЗУслуги.Количество() > 1 Тогда
	//	Сообщить("Во всех строках табличной части ""Услуги"" должно быть указано одинаковое значение колонки ""Отгрузка в рублях""");
	//	НесколькоЗначенийОтгрузкиВРублях = Истина;
	//КонецЕсли;
		
	Если ЕстьНезаполненнаяВалюта ИЛИ НесколькоСчетовНаПредоплату Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Услуги.Количество() > 0 И Товары.Количество() = 0 Тогда
		Сообщить("Для заявок с услугами обязательно должны быть заполнены товары");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из Услуги Цикл
		Если Строка.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
			Сообщить("Для строки № " + Строка.НомерСтроки + " табличной части ""Услуги"" необходимо указать номенклатуру-услугу");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
			
	Если СостояниеЗаявки <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден и СостояниеЗаявки <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
		СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Подтвержден;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Движения.Лико_ПараметрыОтрузки.Записывать = Истина;
	Движения.Лико_ЗаявкиНаОтгрузку.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		// регистр Лико_ПараметрыОтрузки 
		Движение = Движения.Лико_ПараметрыОтрузки.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары);
		Движение.Период=Дата;
		Движение.Валюта = ТекСтрокаТовары.ВалютаЦены;
		Движение.Грузополучатель = ?(ЗначениеЗаполнено(ТекСтрокаТовары.Грузополучатель), ТекСтрокаТовары.Грузополучатель, ТекСтрокаТовары.Контрагент);

		// регистр Лико_ЗаявкиНаОтгрузку Приход
		Движение = Движения.Лико_ЗаявкиНаОтгрузку.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары);
		Движение.КоличествоНеОтгружено = ТекСтрокаТовары.Количество;
		Движение.ДокументОприходования = ЭтотОбъект.Ссылка;
		Движение.Грузополучатель = ?(ЗначениеЗаполнено(ТекСтрокаТовары.Грузополучатель), ТекСтрокаТовары.Грузополучатель, ТекСтрокаТовары.Контрагент);
		
	КонецЦикла; 
	Движения.Лико_ПараметрыОтрузки.Записать();
	
	//+ Лико m.shenderov 25.01.2022
	ТзЗаказы = ДополнительныеСвойства.ТзЗаказы;
	Для каждого Товар Из Товары Цикл
		НоваяСтрТз=ТзЗаказы.Добавить();
		НоваяСтрТз.ЗаказКлиента=Товар.ЗаказКлиента;		
	КонецЦикла;
	ТзЗаказы.Свернуть("ЗаказКлиента");
	Документы.Лико_ЗаявкаНаОтгрузку.ЕстьЗаявкаНаОтгрузку(ТзЗаказы.ВыгрузитьКолонку("ЗаказКлиента"));
	//- Лико m.shenderov 25.01.2022

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Создан; 
	СозданаИзЗаказаСчета = Ложь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 

	УстановитьПривилегированныйРежим(Истина);
	
	Если Площадка.Организация <> Организация Тогда
		Организация = Площадка.Организация;
	КонецЕсли;
	
	//+ Лико m.shenderov 25.01.2022
	ДополнительныеСвойства.Вставить("ТзЗаказы",  Ссылка.Товары.Выгрузить(,"ЗаказКлиента"));
	//- Лико m.shenderov 25.01.2022 
	ДополнительныеСвойства.Вставить("СостояниеЗаявкиВСсылке", Ссылка.СостояниеЗаявки);
	
	СуммаДокумента = 0;
	Для каждого Строка из Товары Цикл
		СуммаДокумента = СуммаДокумента + Строка.Количество * Строка.Цена;
	КонецЦикла;
	
	Для каждого Строка из Услуги Цикл
		СуммаДокумента = СуммаДокумента + Строка.Количество * Строка.Цена;
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		Контрагент = Товары[0].Контрагент;
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
	
	Если ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
		//ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		//ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки
		ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки
		Тогда
		Если НЕ ЗначениеЗаполнено(СкладХранения) Тогда
			Сообщить("Для заявки с типом отгрузки """ + ТипОтгрузки + """ обязательно заполнение склада хранения");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Если СкладХранения = Склад Тогда
			Сообщить("Склад и склад хранения должны отличаться");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Экофлекс может создавать с любой датой
	Если Площадка <> Справочники.Лико_Площадки.Сибирь И НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДоступКИзменениюЗакрытыхЗаявокНаОтгрузку")) Тогда 
		
		Если Ссылка.СостояниеЗаявки = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт Тогда
			Сообщить("В закрытые заявки нельзя вносить изменения!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Если  ((ТекущаяДата()>=НачалоДня(ТекущаяДата())+61200) и (НачалоДня(ДатаОтгрузки)=НачалоДня(ТекущаяДата())+86400)) Тогда
				Сообщить("После 17 часов текущего дня нельзя проводить заявку на завтра. Перенесите на другую дату.");
				Отказ = Истина;
				Возврат;
			ИначеЕсли НачалоДня(ДатаОтгрузки)<=НачалоДня(ТекущаяДата()) Тогда
				Сообщить("Нельзя проводить заявку с датой отгрузки меньшей, чем завтрашний день. Перенесите на другую дату.");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	// --> Начало Лико Ефимов ЕВВ 16.03.2022
	ДатаНачалаПроверкиВалютыВСоглашениях = Дата('20220401000000');
	Если Дата > ДатаНачалаПроверкиВалютыВСоглашениях 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиенту
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
			ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуЧерезСкладРегиона)
		Тогда
		ПроверятьВалютуВСоглашенииЗаказа = Истина;
	Иначе
		ПроверятьВалютуВСоглашенииЗаказа = Ложь;
	КонецЕсли;
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	ВсеЗаказыПослеДатыНачалаПроверкиВалюты = Истина;
	Если ПроверятьВалютуВСоглашенииЗаказа Тогда
		Для каждого Строка из Товары Цикл
			Если Строка.ЗаказКлиента.Дата < ДатаНачалаПроверкиВалютыВСоглашениях Тогда
				ВсеЗаказыПослеДатыНачалаПроверкиВалюты = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 16.03.2022
	// --> Начало Лико Ефимов ЕВВ 04.04.2022
	МассивВалютСоглашений = Новый Массив;
	МассивОтсрочекСоглашений = Новый Массив;
	СоответствиеКонтрагентовИЧислоДнейОтсрочек = Новый Соответствие;
	Если ПроверятьВалютуВСоглашенииЗаказа Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТЗ.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|	ВЫРАЗИТЬ(ТЗ.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
			|ПОМЕСТИТЬ ВТ_ТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЗ.Контрагент КАК Контрагент,
			|	ВЫБОР
			|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК БУЛЕВО)) = ИСТИНА
			|			ТОГДА ВТ_ТЗ.Контрагент.Партнер
			|		ИНАЧЕ ВТ_ТЗ.ЗаказКлиента.Партнер
			|	КОНЕЦ КАК Клиент
			|ПОМЕСТИТЬ ВТ_КлиентыСгруппированы
			|ИЗ
			|	ВТ_ТЗ КАК ВТ_ТЗ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО ВТ_ТЗ.Контрагент.Партнер = ПартнерыДополнительныеРеквизиты.Ссылка
			|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""ПриСозданииОтгрузкиБратьПартнераИзКонтрагентаАНеИзЗаказа_fca67e4d4a11435ca3926adb18a18d38"")
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ТЗ.Контрагент,
			|	ВЫБОР
			|		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК БУЛЕВО)) = ИСТИНА
			|			ТОГДА ВТ_ТЗ.Контрагент.Партнер
			|		ИНАЧЕ ВТ_ТЗ.ЗаказКлиента.Партнер
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_КлиентыСгруппированы.Контрагент КАК Контрагент,
			|	ВТ_КлиентыСгруппированы.Клиент КАК Клиент,
			|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ПартнерыДополнительныеРеквизиты.Значение, 0) КАК ЧИСЛО(3, 0))) КАК Лико_МаксимальнаяОтсрочка
			|ИЗ
			|	ВТ_КлиентыСгруппированы КАК ВТ_КлиентыСгруппированы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры.ДополнительныеРеквизиты КАК ПартнерыДополнительныеРеквизиты
			|		ПО ВТ_КлиентыСгруппированы.Клиент = ПартнерыДополнительныеРеквизиты.Ссылка
			|			И (ПартнерыДополнительныеРеквизиты.Свойство.Имя = ""КоличествоДнейОтсрочкиОплаты"")
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_КлиентыСгруппированы.Клиент,
			|	ВТ_КлиентыСгруппированы.Контрагент";
		
		Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(,"Контрагент,ЗаказКлиента"));
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СоответствиеКонтрагентовИЧислоДнейОтсрочек.Вставить(ВыборкаДетальныеЗаписи.Контрагент, ВыборкаДетальныеЗаписи.Лико_МаксимальнаяОтсрочка);
		КонецЦикла;
	  КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 04.04.2022
	
	РазрешеныНулевыеЦены = (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуИСписаниеСОрганизацииПродавца ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя);
	Для каждого Строка из Товары Цикл
		Если Строка.Номенклатура <> Строка.Характеристика.Владелец Тогда
			Отказ = Истина;
			Сообщить("В строке №" + Строка.НомерСтроки + " выбрана характеристика другой номенклатуры.");
		КонецЕсли;
		Если Строка.ЗаказКлиента <> Строка.Характеристика.Лико_ЗаказНоменклатуры Тогда
			Отказ = Истина;
			Сообщить("В строке №" + Строка.НомерСтроки + " выбрана характеристика заказа, отличного от заказа самой строки.");
		КонецЕсли;
		Если Строка.ЗаказКлиента.Товары.Найти(Строка.Характеристика, "Характеристика") = Неопределено Тогда
			Отказ = Истина;
			Сообщить("Строка №" + Строка.НомерСтроки + ": в заказе " + Строка.ЗаказКлиента.НомерБезПрефикса + " нет номенклатуры """ + Строка.Номенклатура + """ (код " + Строка.Номенклатура.Код + "). Удалите эту строку и добавьте еще раз");
		КонецЕсли;
		Если НЕ РазрешеныНулевыеЦены И Строка.Цена = 0 Тогда
			Отказ = Истина;
			Сообщить("Строка №" + Строка.НомерСтроки + ": не заполнена цена");
		КонецЕсли;
		//Если ПроверятьЗаполнениеСчетаНаПредоплату И НЕ СоответствиеКонтрагентовРазрешенаОтгрузкаБезПредоплаты[Строка.Контрагент] И НЕ ЗначениеЗаполнено(Строка.СчетНаОплату) Тогда
		//	Отказ = Истина;
		//	Сообщить("Строка №" + Строка.НомерСтроки + ": не заполнен счет на предоплату");
		//КонецЕсли;
		// --> Начало Лико Ефимов ЕВВ 16.03.2022
		Если ПроверятьВалютуВСоглашенииЗаказа И ВсеЗаказыПослеДатыНачалаПроверкиВалюты Тогда
			ВалютаСоглашения = Строка.ЗаказКлиента.Соглашение.Валюта;
			Если Строка.ОтгрузкаВРублях И ВалютаСоглашения <> ВалютаРегл Тогда
				Отказ = Истина;
				Сообщить("Строка №" + Строка.НомерСтроки + ": установлена галка ""Отгрузка в рублях"", а валюта в соглашении заказа """ + ВалютаСоглашения + """");
			ИначеЕсли НЕ Строка.ОтгрузкаВРублях И Строка.ВалютаЦены <> ВалютаСоглашения Тогда
				Отказ = Истина;
				Сообщить("Строка №" + Строка.НомерСтроки + ": валюта в строке (" + Строка.ВалютаЦены + ") отличается от валюты из соглашения заказа (" + ВалютаСоглашения + ")");
			КонецЕсли;
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 16.03.2022
		// --> Начало Лико Ефимов ЕВВ 04.04.2022
		Если ПроверятьВалютуВСоглашенииЗаказа Тогда
			ЧислоДнейОтсрочкиСоглашения = Строка.ЗаказКлиента.Соглашение.Лико_ЧислоДнейОтсрочки;
			МассивВалютСоглашений.Добавить(Строка.ЗаказКлиента.Соглашение.Валюта);
			МассивОтсрочекСоглашений.Добавить(ЧислоДнейОтсрочкиСоглашения);
			Если СоответствиеКонтрагентовИЧислоДнейОтсрочек[Строка.Контрагент] < ЧислоДнейОтсрочкиСоглашения Тогда
				Отказ = Истина;
				Сообщить("Строка №" + Строка.НомерСтроки + ": число дней отсрочки в соглашении (" + ЧислоДнейОтсрочкиСоглашения + " дней) отличается от максмиально допустимой отсрочки по партнеру (" + СоответствиеКонтрагентовИЧислоДнейОтсрочек[Строка.Контрагент] + " дней)");
			КонецЕсли;
			// <-- Начало Лико Яцун С. В. 16.06.2023 
			Если СоответствиеКонтрагентовИЧислоДнейОтсрочек[Строка.Контрагент] = 0 И НЕ ЗначениеЗаполнено(Строка.СчетНаОплату) Тогда
				Отказ = Истина;
				Сообщить("Строка №" + Строка.НомерСтроки + ": максмиально допустимая отсрочка по партнеру " + СоответствиеКонтрагентовИЧислоДнейОтсрочек[Строка.Контрагент] + " дней. В таком случае нельзя подтвердить заявку без указания счета на предоплату");
			КонецЕсли;	
			// <-- Конец Лико Яцун С. В. 16.06.2023
		КонецЕсли;
		// <-- Конец Лико Ефимов ЕВВ 04.04.2022
	КонецЦикла;
		
	// --> Начало Лико Ефимов ЕВВ 04.04.2022
	Если ПроверятьВалютуВСоглашенииЗаказа Тогда
		МассивВалютСоглашений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивВалютСоглашений);
		Если МассивВалютСоглашений.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В документе " + ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "содержатся заказы с разными валютами соглашений:");
			Для каждого Строка из Товары Цикл
				Сообщить("Строка №" + Строка.НомерСтроки + ": валюта в соглашении - " + Строка.ЗаказКлиента.Соглашение.Валюта);
			КонецЦикла;
		КонецЕсли;
		МассивОтсрочекСоглашений = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОтсрочекСоглашений);
		Если МассивОтсрочекСоглашений.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В документе " + ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "содержатся заказы с разным числом дней отсрочки в соглашениях:");
			Для каждого Строка из Товары Цикл
				Сообщить("Строка №" + Строка.НомерСтроки + ": число дней отсрочки в соглашении - " + Строка.ЗаказКлиента.Соглашение.Лико_ЧислоДнейОтсрочки);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 04.04.2022
	
	// Проверим, не работают ли на складе с этой заявкой
	Если ЗначениеЗаполнено(Ссылка) И НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Лико_ДоступКИзменениюЗакрытыхЗаявокНаОтгрузку")) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_ЗаявкаНаТранспортировку.Ссылка КАК Ссылка,
			|	Лико_ЗаявкаНаТранспортировку.Номер КАК Номер
			|ИЗ
			|	Документ.Лико_ЗаявкаНаТранспортировку КАК Лико_ЗаявкаНаТранспортировку
			|ГДЕ
			|	(Лико_ЗаявкаНаТранспортировку.Продукция.ЗаявкаНаОтгрузку = &ЗаявкаНаОтгрузку
			|			ИЛИ Лико_ЗаявкаНаТранспортировку.ЗаказыНаОтгрузку.ЗаявкаНаОтгрузку = &ЗаявкаНаОтгрузку)
			|	И НЕ Лико_ЗаявкаНаТранспортировку.ПометкаУдаления
			|	И Лико_ЗаявкаНаТранспортировку.Статус <> ЗНАЧЕНИЕ(Перечисление.Лико_СостоянияЗаявокНаТранспортировку.Закрыт)
			|
			|СГРУППИРОВАТЬ ПО
			|	Лико_ЗаявкаНаТранспортировку.Ссылка,
			|	Лико_ЗаявкаНаТранспортировку.Номер";
		
		Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Ошибка = "";
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Отказ = Истина;
			//Ошибка = Ошибка + ВыборкаДетальныеЗаписи.Номер + ", ";
			Ошибка = Ошибка + ?(ЗначениеЗаполнено(Ошибка), ", ", "") + ВыборкаДетальныеЗаписи.Номер;
		КонецЦикла;
		Если ЗначениеЗаполнено(Ошибка) Тогда
			//Ошибка = Сред(Ошибка, 1, СтрДлина(Ошибка) - 2);
			Сообщить("С данной заявкой уже работают на складе. Чтобы внести изменения, кладовщики должны удалить данные по вашей заявке на отгрузку из следующих заявок на транспортировку: " + Ошибка);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ДатаОтгрузки >= Дата('20190131')
		// --> Начало Лико Ефимов ЕВВ 10.05.2023
		// Сделаем исключение для ПеремещениеКлиентуСоСкладаХранения, т.к. здесь нет продажи клиенту, поэтому площадку проверять не нужно
		// Скорее всего со временем сюда можно будет в исключения написать все типы, при которых не создается реализация, потому что насколько
		// я помню, ограничение делали для того, чтобы в договоре реализации однозначно можно было проставить площадку, которой пользуется Капкин в своих отчетах
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения
		// <-- Конец Лико Ефимов ЕВВ 10.05.2023
		Тогда
		// Проверим, чтобы в заказах заявки была выбрана одна площадка
		МассивПлощадок = Новый Массив;
		Для каждого Строка из Товары Цикл
			ТекПлощадка = Строка.ЗаказКлиента.Площадка;
			Если МассивПлощадок.Найти(ТекПлощадка) = Неопределено Тогда
				МассивПлощадок.Добавить(ТекПлощадка);
			КонецЕсли;
		КонецЦикла;
		Если МассивПлощадок.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В одной заявке на отгрузку нельзя выбирать заказы с разными площадками");
		КонецЕсли;	
	КонецЕсли;
	
	Если ДатаОтгрузки >= Дата("20200101") И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя И НЕ ЗначениеЗаполнено(ОрганизацияПродавец) Тогда
		Отказ = Истина;
		Сообщить("Необходимо заполнить организацию-продавца");
	КонецЕсли;
	
	Если Дата >= Дата("20200301") И ЗначениеЗаполнено(Склад.Лико_Площадка) И Склад.Лико_Площадка <> Площадка И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки Тогда
		Отказ = Истина;
		Сообщить("Неправильно выбраны ""Площадка"" или ""Склад""");
	КонецЕсли;
	
	Если СозданаНаОснованииЗаданияНаСписаниеГП И НЕ ДополнительныеСвойства.Свойство("ЗаписьИзЗаданияНаСписаниеГП") Тогда
		Если Не РольДоступна("ПолныеПрава") Тогда
			Отказ = Истина;
			Сообщить("Документ создан из задания на списание ГП. Редактирование вручную невозможно");
		КонецЕсли;	
	КонецЕсли;

	Если (ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки И Склад.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И Склад.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи)
		ИЛИ (ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеСоСкладаОтвХраненияДругойПлощадки И Склад.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки)
		Тогда
		Отказ = Истина;
		Сообщить("Для склада """ + Склад + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
	КонецЕсли;

	Если (СкладХранения.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
		ИЛИ (СкладХранения.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадки И СкладХранения.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараДругойПлощадкиСПравомПродажи И ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеНаСкладОтвХраненияДругойПлощадки)
		Тогда
		Отказ = Истина;
		Сообщить("Для склада """ + СкладХранения + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
	КонецЕсли;
	
	Если	((ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
				ИЛИ ТипОтгрузки = Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения)
			И Склад.Лико_ТипСкладаГотовойПродукции <> Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас)
		ИЛИ
			(Склад.Лико_ТипСкладаГотовойПродукции = Перечисления.Лико_ТипыСкладовГотовойПродукции.ОтветственноеХранениеТовараКлиентаУНас
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеКлиентуСоСкладаХранения
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения
			И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения)
		Тогда
		Отказ = Истина;
		Сообщить("Для склада """ + Склад + """ недоступен тип отгрузки """ + ТипОтгрузки + """");
	КонецЕсли;
	
	// --> Начало Лико Яцун 07.09.2022 
	Если Дата > Дата("20220907150000") 
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.РеализацияКлиентуСПеремещениемНаСкладХранения
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения 
		И ТипОтгрузки <> Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.ПеремещениеМеждуСкладамиХранения 
		И СостояниеЗаявки <> Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		МассивЗаказов = Новый Массив;
		Для каждого Строка из Товары Цикл
			МассивЗаказов.Добавить(Строка.АдресДоставки);
		КонецЦикла;
		МассивЗаказов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗаказов);
		Если МассивЗаказов.Количество() > 1 Тогда
			Отказ = Истина;
			Сообщить("В документе " + ?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + " ", "") + "содержатся заказы с разными адресами доставки");
			Для каждого Строка из Товары Цикл
				Сообщить("Строка №" + Строка.НомерСтроки + ": адрес доставки - " + Строка.АдресДоставки);
			КонецЦикла;
		ИначеЕсли МассивЗаказов.Количество() = 1 Тогда
			Если НЕ ЗначениеЗаполнено(МассивЗаказов[0]) Тогда
				Отказ = Истина;	
				Сообщить("Не заполнен адрес доставки");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	// <-- Конец Лико Яцун 07.09.2022
	
	// --> Начало Лико Ефимов ЕВВ 04.12.2024
	Если Дата >= Дата("20241204") И Товары.Количество() > 0 Тогда
		Партнер = Товары[0].ЗаказКлиента.Партнер;
		ДиадокВыгружатьНамотку = Лико_Дополнительно.ПолучитьЗначениеДопРеквизитаЭлемента(, Партнер, "ДиадокВыгружатьНамотку", Ложь); 
		Если ДиадокВыгружатьНамотку Тогда
			МассивПроверенныхХарактеристик = Новый Массив;
			// Проверим, чтобы по одному заказу не было разных намоток, иначе в Диадок выгрузится максимум из них
			Для каждого Строка из Товары Цикл 
				Если МассивПроверенныхХарактеристик.Найти(Строка.Характеристика) <> Неопределено Тогда
					// Эту характеристику уже проверили, пропустим
					Продолжить;
				КонецЕсли;
				МассивПроверенныхХарактеристик.Добавить(Строка.Характеристика);
				ТекМассивНамоток = Новый Массив;
				НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Характеристика", Строка.Характеристика));
				Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
					ТекМассивНамоток.Добавить(НайденнаяСтрока.Намотка);
				КонецЦикла;
				ТекМассивНамоток = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТекМассивНамоток);
				Если ТекМассивНамоток.Количество() > 1 Тогда
					Отказ = Истина;
					Сообщить(?(ЗначениеЗаполнено(Ссылка), "" + Ссылка + ": ", "") + Строка.Номенклатура + " / " + Строка.Характеристика + " найдено несколько намоток. Нужно оставить только одну");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 04.12.2024
	
	// --> Начало Лико Ефимов ЕВВ 26.05.2025
	Если Дата >= Дата("20250528") И Услуги.Количество() > 0 Тогда
		Для каждого Строка из Услуги Цикл
			Если НЕ ЗначениеЗаполнено(Строка.Характеристика) И Строка.Номенклатура.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда
				Отказ = Истина;
				Сообщить("В строке №" + Строка.НомерСтроки + " таблицы ""Услуги"" необходимо указать характеристику");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Ефимов ЕВВ 26.05.2025
	
	// --> Начало Лико Ефимов ЕВВ 28.10.2025
	// Проверим, что на заказ нет одновременно в работе заявки на отгрузку и заявки на списание
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента,
		|	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		|	ВЫРАЗИТЬ(ТЗ.НомерСтроки КАК ЧИСЛО(5, 0)) КАК НомерСтроки
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования КАК ДокументОприходования,
		|	ТЗ.НомерСтроки КАК НомерСтроки,
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Характеристика КАК Характеристика
		|ИЗ
		|	ТЗ КАК ТЗ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Лико_ЗаявкиНаОтгрузку.Остатки(
		|				,
		|				(ЗаказКлиента, Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ТЗ.ЗаказКлиента,
		|						ТЗ.Номенклатура,
		|						ТЗ.Характеристика
		|					ИЗ
		|						ТЗ)) КАК Лико_ЗаявкиНаОтгрузкуОстатки
		|		ПО ТЗ.ЗаказКлиента = Лико_ЗаявкиНаОтгрузкуОстатки.ЗаказКлиента
		|			И ТЗ.Номенклатура = Лико_ЗаявкиНаОтгрузкуОстатки.Номенклатура
		|			И ТЗ.Характеристика = Лико_ЗаявкиНаОтгрузкуОстатки.Характеристика
		|ГДЕ
		|	Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования <> &ТекущийДокумент
		|	И Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования.Склад = &ТекущийСклад
		|	И Лико_ЗаявкиНаОтгрузкуОстатки.ДокументОприходования.ТипОтгрузки В(&МассивНедоступныхТиповОтгрузки)
		|	И Лико_ЗаявкиНаОтгрузкуОстатки.КоличествоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ДокументОприходования";
	
	МассивТиповОтгрузкиСписания = Новый Массив;
	МассивТиповОтгрузкиСписания.Добавить(Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСОрганизацииПроизводителя);
	МассивТиповОтгрузкиСписания.Добавить(Перечисления.Лико_ТипыОтгрузкиГотовойПродукции.СписаниеСоСкладаХранения); 
	Если МассивТиповОтгрузкиСписания.Найти(ТипОтгрузки) = Неопределено Тогда
		// Это отгрузка, значит проверим, чтобы не было других заявок-списаний
		МассивНедоступныхТиповОтгрузки = МассивТиповОтгрузкиСписания;
	Иначе
		// Это списание, значит проверим, чтобы не было других заявок-отгрузок 
		МассивНедоступныхТиповОтгрузки = Новый Массив;
		Для каждого ТекТипОтгрузки из Перечисления.Лико_ТипыОтгрузкиГотовойПродукции Цикл
			Если МассивТиповОтгрузкиСписания.Найти(ТекТипОтгрузки) = Неопределено Тогда // Все, кроме списаний
				МассивНедоступныхТиповОтгрузки.Добавить(ТекТипОтгрузки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивНедоступныхТиповОтгрузки", МассивНедоступныхТиповОтгрузки);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ТекущийСклад", Склад);
	Запрос.УстановитьПараметр("ТЗ", Товары.Выгрузить(, "ЗаказКлиента,Номенклатура,Характеристика,НомерСтроки"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В строке №" + Выборка.НомерСтроки + " содержится товар, который уже есть в заявке на отгрузку №" + Выборка.ДокументОприходования.Номер + " (" + Выборка.ДокументОприходования.ТипОтгрузки + ")";
		Сообщение.КлючДанных = Выборка.ДокументОприходования; 
		Сообщение.Сообщить();
	КонецЦикла;
	// <-- Конец Лико Ефимов ЕВВ 28.10.2025

	Если НЕ Отказ Тогда
		ДляДоступаСлужебная.Очистить();
		// Заполним ТЧ ДляДоступаСлужебная
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказКлиента.Партнер КАК Партнер,
			|	ЗаказКлиента.Регион КАК Регион,
			|	ЗаказКлиента.ТипЗаказа КАК ТипЗаказа,
			|	ЗаказКлиента.Менеджер КАК Менеджер
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка В(&МассивЗаказов)";
		
		Запрос.УстановитьПараметр("МассивЗаказов", Товары.ВыгрузитьКолонку("ЗаказКлиента"));
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			ДляДоступаСлужебная.Загрузить(ТЗ);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПроверяемыеРеквизиты.Найти("Услуги.ЗаказКлиента") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Услуги.ЗаказКлиента"));
	КонецЕсли;
	Если ПроверяемыеРеквизиты.Найти("Услуги.ВалютаЦены") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Услуги.ВалютаЦены"));
	КонецЕсли;
	Если ПроверяемыеРеквизиты.Найти("Услуги.ОтгрузкаВРублях") <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Услуги.ОтгрузкаВРублях"));
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//+ Лико m.shenderov 25.01.2022 
	Движения.Лико_ПараметрыОтрузки.Записать();
	ТзЗаказы = ДополнительныеСвойства.ТзЗаказы;
	Для каждого Товар Из Товары Цикл
		НоваяСтрТз=ТзЗаказы.Добавить();
		НоваяСтрТз.ЗаказКлиента=Товар.ЗаказКлиента;		
	КонецЦикла;
	ТзЗаказы.Свернуть("ЗаказКлиента");
	Документы.Лико_ЗаявкаНаОтгрузку.ЕстьЗаявкаНаОтгрузку(ТзЗаказы.ВыгрузитьКолонку("ЗаказКлиента"));
	//- Лико m.shenderov 25.01.2022

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
